app/Controllers/Yacht.php

SELECT *
FROM `yacht`
---
	public function index()
	{
		$recordModel = new YachtModel();
		$data['yacht'] = $recordModel->findAll();

SELECT *
FROM `yacht`
WHERE `yacht`.`id` = '7'
SELECT *
FROM `files`
WHERE `yacht_id` = '7'
---
	public function yachtRecordEdit($id)
	{
		$model = new YachtModel();
		$imageModel = new FilesModel();

		$data['record'] = $model->find($id);
		$data['booking'] = $id ? $imageModel->where('yacht_id', $id)->findAll() : $imageModel->findAll();

SELECT *
FROM `yacht`
WHERE `yacht_type` = 'Motor Yachts'
 LIMIT 9
SELECT COUNT(*) AS `numrows`
FROM `yacht`
WHERE `yacht_type` = 'Motor Yachts'
---
	public function LuxuryYachts()
	{
		$model = new YachtModel();
		$model->where('yacht_type', "Luxury Yachts");
		$model->where('status', 'Approve');

		$filter = [
			"booking_date" => 0,
			"location" => 0,
			"yacht_type" => "Luxury Yachts",
			"yacht_length" => 0,
			"price" => 0,
			"cabin" => 0,
			"guest" => 0
		];

		$data = [
			'yachtList' => $model->paginate(9),
			'pager' => $model->pager,
			'filter' => $filter
		];